# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console Matrix
brew "cmatrix"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Language Server for the Lua language
brew "lua-language-server"
# Create modern online books from Markdown files
brew "mdbook"
# CLI tool for saving complete web pages as a single HTML file
brew "monolith"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Painless compression and decompression for your terminal
brew "ouch"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate type safe Go from SQL
brew "sqlc"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Opinionated Lua code formatter
brew "stylua"
# Utility-first CSS framework
brew "tailwindcss"
# LSP for TailwindCSS
brew "tailwindcss-language-server"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Language for writing HTML user interfaces in Go
brew "templ"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Discover, download, and run local LLMs
cask "lm-studio"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Open-source code editor
cask "visual-studio-code"
vscode "catppuccin.catppuccin-vsc"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
